#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
--Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role.smme_frontend_repo_role will be created
  + resource "aws_iam_role" "smme_frontend_repo_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (sensitive)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SMMEGithubActionsFrontendRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "BusinessService"              = "CHANGE"
          + "Confidentiality"              = (sensitive)
          + "Environment"                  = "CHANGE"
          + "ManagedBy"                    = (sensitive)
          + "Name"                         = "SMME Github Actions Frontend Role"
          + "Project"                      = "SMME Merchant Portal"
          + "ResourceManagementAutomation" = "Terraform"
          + "SecurityZone"                 = (sensitive)
          + "TaggingVersion"               = "v2.0"
        }
      + tags_all              = {
          + "BusinessService"              = "CHANGE"
          + "Confidentiality"              = "CHANGE"
          + "Environment"                  = "CHANGE"
          + "ManagedBy"                    = "CHANGE"
          + "Name"                         = "SMME Github Actions Frontend Role"
          + "Project"                      = "SMME Merchant Portal"
          + "ResourceManagementAutomation" = "Terraform"
          + "SecurityZone"                 = "CHANGE"
          + "TaggingVersion"               = "v2.0"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy.smme_frontend_repo_access will be created
  + resource "aws_iam_role_policy" "smme_frontend_repo_access" {
      + id     = (known after apply)
      + name   = "SMMEGithubActionsFrontendRepoAccess"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::vfs-smme-cicd-tf-state",
                          + "arn:aws:s3:::vfs-smme-cicd-tf-state/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy_attachment.smme_state_access_attachment will be created
  + resource "aws_iam_role_policy_attachment" "smme_state_access_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::619132514041:policy/SMMEGithubActionsTerraformStateAccess"
      + role       = "SMMEGithubActionsFrontendRole"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + frontend_repo_role_arn = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
--
```

</details>

*Pushed by: @FabioSVBBD, Action: `pull_request`*